1dikkelul/Kid-Box-Better/sdkconfig.defaults
# sdkconfig.defaults for ESP32-S3-RLCD-4.2 (Waveshare)
# Run "idf.py set-target esp32s3" then "idf.py build" to apply these.
#
CONFIG_IDF_TARGET="esp32s3"
CONFIG_ESPTOOLPY_FLASHMODE_QIO=y
CONFIG_ESPTOOLPY_FLASHFREQ_80M=y
CONFIG_ESPTOOLPY_FLASHFREQ="80m"
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_PARTITION_TABLE_CUSTOM=y

# Octal SPIRAM (8 MB) at 80 MHz
CONFIG_SPIRAM=y
CONFIG_SPIRAM_MODE_OCT=y
CONFIG_SPIRAM_SPEED_80M=y

# LVGL and file-system
CONFIG_FATFS_LFN_HEAP=y
CONFIG_FREERTOS_HZ=1000

# HTTP server header room for long file paths
CONFIG_HTTPD_MAX_REQ_HDR_LEN=512
